Examinator/src/Catalogs/НастройкиИнтерактивногоРесурсаСУЗ/НастройкиИнтерактивногоРесурсаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиИнтерактивногоРесурсаСУЗ</name>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>ИмяПеременной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеТипа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТипа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ЗначенияНастроекИнтерактивныхРесурсовСУЗ/ЗначенияНастроекИнтерактивныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияНастроекИнтерактивныхРесурсовСУЗ</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Представление</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>CatalogRef.НастройкиИнтерактивногоРесурсаСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/НастройкиИнтерактивногоРесурсаСУЗ/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура РазместитьЗначениеНастройки()
	
	РазработкаСУЗ.РазметитьПолеРедактированияНастройкиИнтерактивногоРесурса(ЭтотОбъект, ОписаниеТипа);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	КЧ = Новый КвалификаторыЧисла(14,4);
	КС = Новый КвалификаторыСтроки(0);
	
	Элементы.ОписаниеТипа.ДоступныеТипы = Новый ОписаниеТипов("Строка, Булево, Число, Дата", КЧ, КС);
	Элементы.ОписаниеТипа.РазрешитьСоставнойТип = Ложь;
	
	РазработкаСУЗ.РазметитьПолеРедактированияНастройкиИнтерактивногоРесурса(ЭтотОбъект, ОписаниеТипа);
	
	Если Объект.Количество = 1 Тогда
		
		Элементы.ЗначениеНастройки.Видимость = Истина;
		Элементы.ЗначенияНастроек.Видимость = Ложь;
		
	Иначе
		
		Элементы.ЗначениеНастройки.Видимость = Ложь;
		Элементы.ЗначенияНастроек.Видимость = Истина;
		
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЗначенияНастроек.Отбор, "СсылкаНаОбъектСУЗ", ВладелецНастроек);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЗначенияНастроек.Отбор, "Настройка", Объект.Ссылка);
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ОписаниеТипа     = Новый ОписаниеТипов("Строка");
		ВладелецНастроек = ?(ЗначениеЗаполнено(Параметры.ВладелецНастроек), Параметры.ВладелецНастроек, Объект.Владелец);
		
		РазместитьЗначениеНастройки();
		
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОписаниеТипа     = ТекущийОбъект.ОписаниеТипа.Получить();
	ВладелецНастроек = ?(ЗначениеЗаполнено(Параметры.ВладелецНастроек), Параметры.ВладелецНастроек, Объект.Владелец);
	
	РазместитьЗначениеНастройки();
	
	Если ТекущийОбъект.Количество = 1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Значение
			|ИЗ
			|	РегистрСведений.ЗначенияНастроекИнтерактивныхРесурсовСУЗ КАК ЗначенияНастроекИнтерактивныхРесурсовСУЗ
			|ГДЕ
			|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ
			|	И ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Настройка = &Настройка
			|	И ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Поставщик = &Поставщик
			|	И ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Номер = &Номер";

		Запрос.УстановитьПараметр("Настройка", ТекущийОбъект.Ссылка);
		Запрос.УстановитьПараметр("Номер", 1);
		Запрос.УстановитьПараметр("Поставщик", ТекущийОбъект.Поставщик);
		Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", ВладелецНастроек);

		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда
		
			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			ВыборкаДетальныеЗаписи.Следующий();
			
			ЭтотОбъект["ЗначениеНастройки"] = ВыборкаДетальныеЗаписи.Значение.Получить();
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОписаниеТипа = Новый ХранилищеЗначения(ОписаниеТипа);
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Количество = 1 Тогда
	
		НаборЗаписей = РегистрыСведений.ЗначенияНастроекИнтерактивныхРесурсовСУЗ.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(ВладелецНастроек);
		НаборЗаписей.Отбор.Настройка.Установить(ТекущийОбъект.Ссылка);
		НаборЗаписей.Отбор.Поставщик.Установить(ТекущийОбъект.Поставщик);
		НаборЗаписей.Отбор.Номер.Установить(1);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.СсылкаНаОбъектСУЗ = ВладелецНастроек;
		НоваяЗапись.Настройка         = ТекущийОбъект.Ссылка;
		НоваяЗапись.Поставщик         = ТекущийОбъект.Поставщик;
		НоваяЗапись.Номер             = 1;
		
		НоваяЗапись.Значение          = Новый ХранилищеЗначения(ЭтотОбъект["ЗначениеНастройки"]);
		НоваяЗапись.Представление     = ЭтотОбъект["ЗначениеНастройки"];
		
		НаборЗаписей.Записать();	
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОписаниеТипаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ЗначенияНастроек

&НаКлиенте
Процедура ЗначенияНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщегоНазначенияСУКлиент.ПередВыборомЭлементаПодчиненногоСправочника(ЭтотОбъект, СтандартнаяОбработка);

КонецПроцедуры
